<h3>Реализовать шифрование текста путем замены букв друг другом (напр. A => B, B=>X, итд).
    Каждая буква может представлять только одну другую букву.
    Написать три функции - первая генерирует ключ в виде нового алфавита.
    Вторая шифрует заданный текст по заданному ключу.
    Третья расшифровывает заданный зашифрованный текст по заданному ключу.</h3>
<?php
$strl = $_GET["strl"];
function koding($str) {
    $rus = array('а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я');
    $lat = array('з', 'я', 'а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю');
    return str_replace($rus, $lat, $str);
}
function dekoding($str) {
    $rus = array('А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ё', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ы', 'Ь', 'Э', 'Ю', 'Я', 'а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я');
    $lat = array('A', 'B', 'V', 'G', 'D', 'E', 'E', 'Gh', 'Z', 'I', 'Y', 'K', 'L', 'M', 'N', 'O', 'P', 'R', 'S', 'T', 'U', 'F', 'H', 'C', 'Ch', 'Sh', 'Sch', 'Y', 'Y', 'Y', 'E', 'Yu', 'Ya', 'a', 'b', 'v', 'g', 'd', 'e', 'e', 'gh', 'z', 'i', 'y', 'k', 'l', 'm', 'n', 'o', 'p', 'r', 's', 't', 'u', 'f', 'h', 'c', 'ch', 'sh', 'sch', 'y', 'y', 'y', 'e', 'yu', 'ya');
    return str_replace($lat, $rus, $str);
}

?>


<!DOCTYPE html>
<html>
<head>
    <meta charset="utf-8">
    <title>Задание 5</title>
</head>
<body>
<p>шифрование строки </p>
<form action="" method="get">
    <label>Введите строку</label><br>
    <input type="text" name="strl" value="<?=$strl;?>"/><br><br>
    <input type="submit" name="sumb" value="зашифровать" />
</form>
<p>транслит-<b><?=koding($strl);?></b></p>
<p>функция, которая выполняет обратную операцию</p>
<p>транслит-<b><?=dekoding($strl);?></b></p>
</body>
</html>